Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/back_to_education/back_to_education_allowance.html.txt.tmx
Source language: en
Languages: ga

source: Back to Education Allowance
ga: Liúntas um Fhilleadh ar Oideachas

source: If you are unemployed, parenting alone or have a disability and are getting certain payments from the Department of Social Protection, you may take part in a second-or third-level education course and get a Back to Education Allowance (BTEA)
ga: Má tá tú dífhostaithe, i do thuismitheoir sa bhaile, nó faoi mhíchumas, agus má tá íocaíochtaí áirithe á bhfáil agat ón Roinn Coimirce Sóisialaí, is féidir leat freastal ar chúrsa oideachais dara nó tríú leibhéal agus an Liúntas um Fhilleadh ar Oideachas (BTEA) a fháil

source: If you want to do other types of courses not covered under the BTEA, for example, personal development courses or general training courses you may return to education under the Part-time Education option, the Vocational Training Opportunities Scheme (VTOS) or the Education, Training and Development option. The Department of Social Protection has published Frequently Asked Questions about the scheme
ga: Más mian leat cúrsaí de chineálacha eile a dhéanamh nach gcuimsítear faoin BTEA, mar shampla, cúrsaí forbartha pearsanta nó cúrsaí oiliúna ginearálta, is féidir leat filleadh ar an oideachas faoin Rogha Oideachais, Oiliúna agus Forbartha; Rogha Oideachais pháirtaimseartha; nó faoin Scéim Deiseanna Oiliúna Gairmoideachais (VTOS)

source: Since 2016/17, BTEA is only paid for courses that start in Ireland or in Northern Ireland
ga: Ó 2016/2017 ar aghaidh, ní íoctar an LFAO ach do chúrsaí a thosaíonn in Éirinn nó i dTuaisceart Éireann

source: You can be paid BTEA for a year abroad (for example, under the Erasmus scheme) if the year is an integral or mandatory part of your course
ga: Féadtar LFAO a íoc leat le haghaidh bliana a chaitheann tú thar lear (mar shampla, faoi scéim Erasmus) má tá an bhliain ina cuid lárnach nó éigeantach de do chúrsa

source: This must be verified by the Registrar or Admissions office of your college
ga: Ní mór go ndéanann an Cláraitheoir nó an Oifig Iontrála i do choláiste seo a dheimhniú

source: Two study options are available under the scheme:
ga: Tá dhá rogha staidéir ar fáil faoin scéim seo:

source: All courses must lead to a Quality and Qualifications Ireland (QQI) accreditation (these include FETAC or HETAC awards) or equivalent
ga: Ní mór go n-eascróidh creidiúnú Dhearbhú Cáilíochta agus Cáilíochtaí Éireann (QQI) as gach cúrsa (áirítear leo seo dámhachtainí FETAC nó HETAC) nó a gcomhionann

source: You must also progress in educational qualifications
ga: Anuas air sin, ní mór duit dul chun cinn a dhéanamh i gcáilíochtaí oideachais

source: For example, if you already have a Level 6 qualification on the National Framework of Qualifications, the course you attend must be for at least a Level 7 qualification
ga: Mar shampla, má tá cáilíocht Leibhéal 6 bainte amach agat ar an gCreat Náisiúnta Cáilíochtaí cheana féin, ní mór go mbeidh cáilíocht Leibhéal 7, ar a laghad, le baint amach sa chúrsa ar a bhfreastalaíonn tú

source: This progression rule has been relaxed for people applying for second-level courses at Levels 5 and 6 in certain limited circumstances
ga: Ó Mheitheamh 2014, maolaíodh an riail um dhul chun cinn seo i measc daoine a dhéanann iarratas ar chúrsaí dara leibhéal ar Leibhéal 5 agus 6 faoi chúinsí teoranta áirithe

source: If you already hold a Level 5 or 6 qualification in an area that is no longer growing (obtained at least 3 years ago) and you have worked for at least 3 years and you satisfy all the other BTEA criteria, you may be allowed to do further courses at either of these levels - provided the course is at second level, will enable you to progress your career, lasts no more than 2 years (24 months) and meets future skills needs or local demand
ga: Má tá cáilíocht Leibhéal 5 nó 6 bainte amach cheana féin agat i limistéar nach bhfuil ag fás a thuilleadh, má d’oibrigh tú ar feadh 3 bliana, ar a laghad, in Éirinn agus má shásaíonn tú gach critéar eile den BTEA, b’fhéidir go mbeidh cead agat breis cúrsaí a dhéanamh ar cheachtar de na leibhéil seo – a fhad agus atá an cúrsaí ar an dara leibhéal, a fhad agus go gcuirfidh an cúrsa ar do chumas do

source: Your DSP case officer must also recommend the course if you are getting a jobseeker's payment
ga: Ní mór do d’Oifigeach Cáis de chuid na RCS an cúrsa a mholadh, chomh maith

source: You can attend a second-level course of education at any secondary, community, comprehensive or vocational school
ga: Féadfaidh tú freastal ar chúrsa oideachais dara leibhéal ag aon mheánscoil, pobalscoil, scoil chuimsitheach nó gairmscoil

source: The course must be full-time and lead to a certificate recognised by the Department of Education and Skills or approved by Quality and Qualifications Ireland (QQI), for example, Junior Certificate, Leaving Certificate, Post Leaving Certificate or a City and Guilds Certificate
ga: Ní mór gur cúrsa lánaimseartha atá sa chúrsa agus ní mór go n-eascróidh teastas as a aithníonn an Roinn Oideachais agus Scileanna nó a fhaomhann Dearbhú Cáilíochta agus Cáilíochtaí Éireann (DCCÉ), mar shampla, an Teastas Sóisearach, an Ardteistiméireacht, cúrsa Iar-Ardteistiméireachta nó Teastas City and Guilds

source: An Access or Foundation course is considered to be a second-level course for BTEA purposes
ga: Ní mheastar gurb ionann cúrsa Rochtana nó Bonnleibhéil agus cúrsa dara leibhéal ar mhaithe le cuspóirí LFAO

source: You can attend any third-level course of education in an approved third level institution (university, institute of education or third level college)
ga: Féadfaidh tú freastal ar aon chúrsa tríú leibhéal oideachas in institiúid tríú leibhéal (ollscoil, institiúid oideachais nó coláiste tríú leibhéal)

source: The course must be a full-time day course and be approved for the Student Grant Scheme or be approved by the Higher Education and Training Awards Council (HETAC)
ga: Ní mór gur cúrsa lánaimseartha lae atá sa chúrsa agus ní mór go mbíonn sé faofa don Scéim Deontas Mac Léinn nó a bheith faofa ag Comhairle na nDámhachtainí Ardoideachais agus Oiliúna (HETAC)

source: Note that not all HETAC courses are approved for BTEA
ga: Tabhair faoi deara nach bhfuil gach cúrsa de chuid HETAC faofa don LFAO

source: In general you must be starting your third-level course at year one
ga: Go ginearálta, ní mór go bhfuil tús á chur agat le do chúrsa tríú leibhéal ag bliain a haon

source: However, you may be eligible for BTEA if you:
ga: B’fhéidir go mbeifeá i dteideal LFAO a fháil, áfach:

source: • Are exempt from part of your course because of a qualification you received in a previous course
ga: • Má tá tú díolmhaithe ó chuid de do chúrsa mar gheall ar cháilíocht a bhain tú amach i gcúrsa roimhe seo

source: For example, you have a higher certificate in a course that you now wish to take to degree level
ga: Mar shampla, tá ardteastas bainte amach agat i gcúrsa agus tá sé ar intinn anois agat tabhairt faoi chúrsa den chineál sin ar leibhéal céime

source: • Completed a year (or years) of your course as a part-time student
ga: • Má chríochnaigh tú bliain amháin (nó níos mó) de do chúrsa mar mhac léinn páirtaimseartha

source: • Completed earlier years before becoming unemployed or receiving statutory redundancy
ga: • Má chríochnaigh tú blianta níos luaithe sula raibh tú dífhostaithe nó sula ndearnadh iomarcach go reachtúil thú

source: • Are permitted by your school or college to proceed to the next year of a course having dropped out or deferred a year (due to mitigating circumstances)
ga: • Má cheadaíonn do scoil nó coláiste duit leanúint ar aghaidh chuig an gcéad bhliain eile i gcúrsa tar éis gur éirigh tú as an gcúrsa nó gur chuir tú an cúrsa siar (mar gheall ar chúinsí maolaithe)

source: • Were getting a One-Parent Family Payment (OFP) while in full-time education and were affected by age-related changes to OFP
ga: • Má bhí Íocaíocht Teaghlach Aontuismitheora (ÍTA) á fáil agat fad a bhí tú ag tabhairt faoi oideachas lánaimseartha agus má rinne athruithe a bhaineann le haois a tháinig ar an ÍTA difear duit

source: People in this situation may be admitted to BTEA mid-course
ga: Más féidir daoine sa chás seo a cheadú bheith rannpháirteach in LFAO i lár an chúrsa

source: You can get the Back to Education Allowance for a postgraduate course of study that leads to a Higher Diploma (H.Dip.) qualification in any discipline or a Professional Masters in Education
ga: Is féidir leat an Liúntas um Fhilleadh ar Oideachas a fháil i dtaobh cúrsa staidéir iarchéime óna n-eascraíonn cáilíocht Ard-Dioplóma (H.Dip.) i ndisciplín ar bith nó a n-eascraíonn Máistreacht Ghairmiúil san Oideachas as

source: Other types of postgraduate qualifications are not recognised for BTEA
ga: Ní bhfaighidh tú an BTEA má tá agat cheana cáilíocht iarchéime

source: The only exception to this is where a college has admitted a person without a third-level qualification to a Master’s course on the basis of relevant life experience - in these cases the person may be entitled to BTEA
ga: Níl ach aon eisceachta amháin. Má lig coláiste duine gan bhunchéim isteach ar chúrsa Mháistir de bharr taithí ar an saol ábhar. Sna cásanna seo, d’fhéadfadh an duine teidlíocht LFO a bheith aige

source: You will not get BTEA if you already have a postgraduate qualification
ga: Ní bhfaighidh tú an BTEA má tá cáilíocht iarchéime bainte amach agat cheana féin

source: The Student Grant Scheme is divided into 2 components – maintenance grants and fee grants
ga: Roinnfear an Scéim Deontais do Mhic Léinn in 2 chomhábhar – deontais chothabhála agus deontais táillí

source: You cannot get the Back to Education Allowance (BTEA) and the maintenance component of a student grant together
ga: Ní féidir leat an Liúntas um Fhilleadh ar Oideachas (BTEA) agus an comhábhar cothabhála de dheontas mac léinn a fháil le chéile

source: Although you are not entitled to the maintenance component of the student grant, you must still submit a student grant application form to be assessed for a fee grant to pay your Student Contribution (formerly called the student services charge), field trip costs and tuition fees (if payable)
ga: Cé nach bhfuil tú i dteideal an comhábhar cothabhála de dheontas mac léinn a fháil, ní mór duit foirm iarratais ar dheontas mac léinn a chur ar aghaidh go ndéanfar í a mheasúnú do dheontas táillí chun íoc as do Ranníocaíocht Mac Léinn (ar ar tugadh an muirear seirbhísí mac léinn roimhe seo), as costais turas allamuigh agus as táillí teagaisc (más iníoctha)

source: If you are getting a One-Parent Family Payment (or Jobseeker’s Transitional payment) or a disability payment (Disability Allowance, Invalidity Pension or Illness Benefit) you can choose to stay on your current social welfare payment (if you continue to meet the rules of the scheme) and apply for a student grant or you can choose to transfer to the BTEA, depending on which option benefits you most
ga: Má tá Íocaíocht Teaghlach Aontuismitheora nó íocaíocht mhíchumais (Liúntas Míchumais, Pinsean Easláinte nó Sochar Breoiteachta) á fáil agat, is féidir leat roghnú le leanúint agus d’íocaíocht reatha leasa shóisialaigh a fháil agus cur isteach ar dheontas mac léinn nó is féidir leat roghnú chun aistriú chuig an BTEA

source: In general, people who are studying full-time are not entitled to Rent Supplement unless they are getting BTEA
ga: Go ginearálta, níl daoine a bhfuil staidéar lánaimseartha á dhéanamh acu i dteideal Forlíonadh Cíosa a fháil mura bhfuil LFAO á fháil acu

source: Read more in our document on social welfare payments and student grants
ga: Léigh níos mó faoi inár gcáipéisíocht ar íocaíochtaí leasa shóisialaigh agus ar dheontais mhac léinn

source: In general, to qualify for the BTEA you must be over 21, or over 24 for postgraduate courses - see also 'Age limits' below - and have been getting a qualifying social welfare payment
ga: Go ginearálta, ní mór duit bheith níos sine ná 21 bliain d’aois nó níos sine ná 24 bliain d’aois maidir le cúrsaí iarchéime (féach freisin ‘Aoisteorainneacha’ thíos) agus ní mór go raibh íocaíocht cháilitheach leasa shóisialaigh á fáil agat

source: You must always have been accepted onto a qualifying course
ga: Ní mór gur glacadh leat i gcónaí ar chúrsa cáilitheach

source: Qualifying social welfare payments
ga: Íocaíochtaí cáilitheacha leasa shóisialaigh

source: • Jobseeker's Allowance or Jobseeker's Benefit • Jobseeker's Transitional payment
ga: • Liúntas Cuardaitheora Poist nó Sochar Cuardaitheora Poist

source: • Deserted Wife's Benefit or Allowance
ga: • Sochar nó Liúntas Ban Chéile Tréigthe

source: • Widow's, Widower's or Surviving Civil Partner's (Contributory) Pension
ga: • Pinsean Baintrí nó Baintreach Fir Mharthanaigh (Ranníocach)

source: • Widow's, Widower's or Surviving Civil Partner's (Non-Contributory) Pension
ga: • Pinsean Baintrigh nó Baintreach Fir Mharthanaigh (Neamhranníocach)

source: • Incapacity Supplement (based on a life Disablement Pension)
ga: • Forlíonadh Éagumais (bunaithe ar Phinsean Míchumais saoil)

source: • Illness Benefit for 2 years or more
ga: • Sochar Breoiteachta 2 bhliain nó níos faide

source: (However periods spent on Illness Benefit can count towards the qualifying period if you qualify from another payment
ga: (Féadtar tréimhsí a chaitear le Sochar Breoiteachta a fháil a chur san áireamh i dtreo na tréimhse cáilithí má cháilíonn tú ó íocaíocht eile

source: Half of the qualifying period must relate to the qualifying payment.)
ga: Ní mór go mbaineann leath na tréimhse cáilithí leis an íocaíocht cháilitheach.)

source: Since 1 January 2015 you no longer qualify for BTEA when your Jobseeker’s Benefit ends – after 6 or 9 months
ga: Ón 1 Eanáir 2015 ar aghaidh, ní cháileoidh tú do LFAO a thuilleadh nuair a chuirtear deireadh le do Shochar Cuardaitheora Poist – i ndiaidh 6 nó 9 mí

source: You must qualify for another payment to continue to get BTEA
ga: Ní mór duit cáiliú d’íocaíocht eile chun leanúint le LFAO a fháil

source: People who qualified for BTEA from Jobseeker’s Benefit before 1 January 2015 can continue to get BTEA until the end of their course and if they are progressing to a new approved course
ga: Is féidir le daoine a cháiligh do LFAO nuair a bhí Sochar Cuardaitheora Poist á fháil acu roimh an 1 Eanáir 2015 leanúint le LFAO a fháil go dtí deireadh a gcúrsa agus má bheidh siad ag leanúint ar aghaidh go dtí cúrsa nua faofa

source: For second level courses you must have been getting a qualifying social welfare payment (see above) for at least 3 months (78 paid or credited days of unemployment). You must be getting the qualifying payment immediately before you start the course
ga: I dtaobh cúrsaí dara leibhéal, ní mór go raibh íocaíocht cháilitheach leasa shóisialaigh á fáil agat (féach thuas) ar feadh 3 mhí (78 lá dífhostaíochta) ar a laghad díreach sula dtosaíonn tú an cúrsa

source: For third level courses you must have been getting a qualifying social welfare payment (see above) for 9 months (234 paid or credited days of unemployment). You must be getting the qualifying payment immediately before you start the course
ga: I dtaobh cúrsaí tríú leibhéal, ní mór go raibh íocaíocht cháilitheach leasa shóisialaigh á fáil agat (féach thuas) ar feadh 9 mí (234 lá dífhostaíochta) ar a laghad díreach sula dtosaíonn tú an cúrsa

source: For the Professional Masters in Education, you must have been getting a qualifying social welfare payment for 12 months (312 paid or credited days of unemployment
ga: Le haghaidh Dioplóma Iarchéime in Oideachas, ní mór go raibh íocaíocht cháilitheach leasa shóisialaigh á fáil agat ar feadh 12 mhí (312 lá)

source: Satisfying the qualifying period
ga: An tréimhse cháilithe a shásamh

source: You do not have to have been getting your qualifying payment continuously
ga: Ní gá go raibh d’íocaíocht cháilitheach á fáil agat go leanúnach

source: Periods spent on other qualifying social welfare payments (or getting credits) that are not broken by more than 12 months (52 weeks) can be used to determine whether you satisfy the qualifying period criteria
ga: Is féidir tréimhsí ina raibh íocaíochtaí eile cáilitheacha leasa shóisialaigh á bhfáil (nó creidmheasanna á bhfáil) nach bhfuil sos breis agus 12 mhí (52 seachtain) eatarthu a úsáid lena dheimhniú cibé acu an sásaíonn nó nach sásaíonn tú critéir na tréimhse cáilithe

source: You must always be getting a qualifying payment immediately before starting your course
ga: Ní mór go bhfuil íocaíocht cháilitheach á bhfáil agat díreach sula dtosaíonn tú do chúrsa

source: Time spent on the Back to Education Allowance (BTEA), Vocational Training Opportunities Scheme (VTOS), full-time FET (formerly FÁS) training courses, Community Employment schemes, Part-time Job Incentive scheme, Gateway, Community Services Programme, Rural Social Scheme, TÚS, Workplace Placement Scheme (WPP), Back to Work Enterprise Allowance, Short Term Enterprise Allowance, Job Initiative, Job Assist and JobBridge may count towards the qualifying period for BTEA purposes
ga: D’fhéadfadh go gcuirfí am a chaitear ar an Liúntas um Fhilleadh ar Oideachas (BTEA), an Scéim Deiseanna Oiliúna Gairmoideachais (VTOS), cúrsaí lánaimseartha oiliúna de chuid FET, FIT, scéimeanna Fostaíocht Pobail, an Scéim Dreasachta Poist Pháirtaimseartha, an Clár Seirbhísí Pobail, an Scéim Shóisialta Tuaithe, TÚS, an Scéim Náisiúnta Intéirneachta, an Scéim Socrúchán Oibre (CSO), an Liúntas Fiontraíochta um Fhilleadh ar Obair, an Liúntas Fiontraíochta Gearrthréimseach, Tionscnamh Poist FÁS, Postchúnamh Ioncaim san áireamh i dtreo na tréimhse cáilitheachta

source: This provision only applies where you have established an entitlement to a qualifying social welfare payment immediately before you start your course of study
ga: Ní bhíonn sé seo i gceist ach amháin má chruthaíonn tú teidlíocht i leith íocaíocht cháilitheach leasa shóisialaigh díreach sula dtosaíonn tú do chúrsa ceadaithe staidéir

source: Time spent on Youthreach can count towards the qualifying period provided you establish an entitlement to a qualifying social welfare payment before or after completing the Youthreach programme
ga: Is féidir am a caiteadh ar Youthreach a chur san áireamh i dtreo na tréimhse cáilitheachta a fhad agus a chruthaíonn tú teidlíocht i leith íocaíocht cháilitheach leasa shóisialaigh sula gcríochnaíonn tú an clár Youthreach nó i ndiaidh duit é a chríochnú

source: Time spent in prison in the Irish State can count towards the qualifying period provided you establish an entitlement to a qualifying social welfare payment
ga: Is féidir am a caiteadh sa phríosún a chur san áireamh i dtreo na tréimhse cáilitheachta a fhad agus a chruthaíonn tú teidlíocht i leith íocaíocht cháilitheach leasa shóisialaigh

source: Time spent on Supplementary Welfare Allowance (SWA) or on direct provision can count towards the qualifying period for BTEA
ga: Is féidir am a caitheadh ar an Liúntas Forlíontach Leasa Shóisialaigh (LFLS) nó ar sholáthar díreach a chur san áireamh i dtreo na tréimhse cáilitheachta don BTEA

source: This applies only if you establish an entitlement to a qualifying social welfare payment immediately before you start your course of study and satisfy the linking rules (see above)
ga: Ní bhíonn sé seo i gceist ach amháin má chruthaíonn tú teidlíocht i leith íocaíocht cháilitheach leasa shóisialaigh díreach sula dtosaíonn tú do chúrsa ceadaithe staidéir

source: If you have been awarded statutory redundancy and are entitled to a qualifying social welfare payment immediately before you start the course you can get immediate access to the BTEA without any waiting period
ga: Má bronnadh iomarcaíocht reachtúil ort agus má tá tú i dteideal íocaíocht cháilitheach leasa shóisialaigh a fháil díreach sula dtosaíonn tú an cúrsa, is féidir leat rochtain láithreach a fháil ar an BTEA gan aon tréimhse feithimh

source: You must take part in the BTEA scheme within one year of getting statutory redundancy and satisfy all the other conditions
ga: Ní mór duit páirt a ghlacadh i scéim an BTEA laistigh de bhliain amháin ó iomarcaíocht reachúil a fháil

source: To qualify for the Back to Education Allowance, you must be at least 21 years of age
ga: Chun cáiliú don Liúntas um Fhilleadh ar Oideachas, ní mór duit bheith 21 bliain d’aois ar a laghad

source: You must be 24 for a third-level postgraduate course
ga: Ní mór duit bheith 24 bliain d’aois chun cáiliú do chúrsa iarchéime tríú leibhéal

source: However, if you are getting Jobseeker's Allowance, Jobseeker's Benefit, Jobseeker's Transitional payment or One-Parent Family Payment for the required period (3 months/78 days, 9 months/234 days or 12 months/312 days), are aged between 18 and 20 and have been out of the formal education system for at least 2 years you may qualify
ga: Má tá Liúntas Cuardaitheora Poist, Sochar Cuardaitheora Poist nó Íocaíocht Teaghlach Aontuismitheora a fáil agat, áfach, don tréimhse riachtanach (3 nó 9 mí), má tá tú idir 18 agus 20 bliain d’aois agus má tá an córas oideachais foirmiúil fágtha agat ar feadh 2 bhliain ar a laghad, d’fhéadfá cáiliú

source: If you are aged 18 or over (over 24 for the postgraduate option) and getting Blind Pension, Disability Allowance, Invalidity Pension or Incapacity Supplement for the required period (3 months/78 days or 9 months/234 days) you may qualify
ga: Má tá tú 18 mbliana d’aois nó níos sine (níos sine ná 24 bliain d’aois don rogha iarchéime) agus má tá Pinsean na nDall, Liúntas Míchumais, Pinsean Easláinte nó Forlíonadh Éagumais á fháil agat don tréimhse riachtanach (3 mí/78 lá nó 9 mí/234 lá) d’fhéadfá cáiliú

source: Unemployment or illness credits
ga: Creidmheasanna dífhostaíochta nó breoiteachta

source: If you are signing on for unemployment credits or submitting medical certificates for illness credits, for the required period of time (either 3, 9, 12 months or 2 years depending on your course), you may qualify to participate in the BTEA scheme on a non-payment basis
ga: Má tá tú ag síniú le haghaidh creidmheasanna dífhostaíochta nó má tá teastais leighis á gcur ar aghaidh agat do chreidmheasanna breoiteachta, don tréimhse riachtanach ama (cibé acu 3 nó 9 mí ag brath ar do chúrsa), d’fhéadfá cáiliú chun páirt a ghlacadh i scéim an BTEA ar bhonn neamhíocaíochta

source: This means that you do not get a weekly Back to Education Allowance
ga: Ciallaíonn seo nach bhfaigheann tú Liúntas seachtainiúil um Fhilleadh ar Oideachas

source: You continue to be awarded credited contributions while you are taking part in the BTEA scheme
ga: Leanann tú le ranníocaíochtaí creidiúnaithe a fháil fad atá páirt á glacadh agat i scéim an BTEA

source: If you are participating in the BTEA scheme on a non-payment basis, you can also apply for a student grant to be assessed for both the fee and maintenance component of the grant
ga: Má tá páirt á glacadh agat i scéim an BTEA ar bhonn neamhíocaíochta, is féidir leat cur isteach, freisin, ar dheontas mac léinn go ndéanfaí measúnú ort don chomhábhar táillí agus cothabhála den deontas

source: Other people who can qualify for BTEA
ga: Daoine eile ar féidir leo cáiliú don BTEA

source: Since 2 June 2015, qualified adults must establish an entitlement to a qualifying payment in their own right before they can be approved for BTEA
ga: Ón 2 Meitheamh 2015, beidh ar dhaoine fásta cáilithe teidlíocht d’íocaíocht cháilitheach a dheimhniú ina gceart féin sular féidir iad a fhaomhadh do LFAO

source: The rate payable is based on their entitlement
ga: Bunaítear an ráta atá iníoctha ar a dteidlíocht

source: You can use time spent as a qualified adult to satisfy the qualifying period
ga: Féadfaidh tú am caite mar dhuine fásta cáilithe a úsáid chun an tréimhse cáilithe a shásamh
